In [5]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [7]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
target=df.Survived
inputs=df.drop('Survived', axis='columns')

In [12]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [14]:
merged=pd.concat([inputs,dummies], axis='columns')
merged.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [18]:
final=merged.drop(['Sex','male'], axis='columns')
final.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [20]:
final.columns[final.isna().any()]

Index(['Age'], dtype='object')

In [23]:
final.Age=final.Age.fillna(final.Age.mean())
final.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [43]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(final,target,test_size=0.2)

In [44]:
len(x_train)

712

In [45]:
len(x_test)

179

In [46]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [47]:
model.fit(x_train,y_train)

GaussianNB()

In [48]:
model.score(x_test,y_test)

0.8156424581005587

In [49]:
y_test[:10]

602    0
250    0
836    0
479    1
463    0
779    1
663    0
852    0
258    1
434    0
Name: Survived, dtype: int64

In [50]:
model.predict(x_test[:10])

array([0, 0, 0, 1, 0, 1, 0, 1, 1, 0], dtype=int64)

In [52]:
model.predict_proba(x_test[:10])

array([[6.78801616e-01, 3.21198384e-01],
       [9.56845434e-01, 4.31545664e-02],
       [9.52100032e-01, 4.78999685e-02],
       [2.94545022e-01, 7.05454978e-01],
       [9.16321571e-01, 8.36784287e-02],
       [1.40740513e-07, 9.99999859e-01],
       [9.58883157e-01, 4.11168425e-02],
       [3.34394106e-01, 6.65605894e-01],
       [1.08203819e-38, 1.00000000e+00],
       [6.16069772e-01, 3.83930228e-01]])